wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_hpdf.c
/*!
    \file    gd32h77x_hpdf.c
    \brief   HPDF driver

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_hpdf.h"
#include <stdlib.h>

/* HPDF register bit offset */
#define CH0CTL_CKOUTDIV_OFFSET              ((uint32_t)0x00000010U)               /*!< bit offset of CKOUTDIV in HPDF_CH0CTL */
#define CHXCFG_DTRS_OFFSET                  ((uint32_t)0x00000003U)               /*!< bit offset of DTRS in HPDF_CH0CFG */
#define CHXCFG0_CALOFF_OFFSET               ((uint32_t)0x00000008U)               /*!< bit offset of CALOFF in HPDF_CH0CFG */
#define CHXCFG1_TMFOR_OFFSET                ((uint32_t)0x00000010U)               /*!< bit offset of TMFOR in CHXCFG1 */
#define FLTYSFCFG_SFOR_OFFSET               ((uint32_t)0x00000010U)               /*!< bit offset of SFOR in FLTYSFCFG */
#define FLTYIDATAT_IDATA_OFFSET             ((uint32_t)0x00000008U)               /*!< bit offset of IDATA in FLTYIDATA */
#define FLTYRDATAT_RDATA_OFFSET             ((uint32_t)0x00000008U)               /*!< bit offset of RDATA in FLTYRDATA */
#define FLTYTMHT_HTVAL_OFFSET               ((uint32_t)0x00000008U)               /*!< bit offset of HTVAL in FLTYTMHT */
#define FLTYTMLT_LTVAL_OFFSET               ((uint32_t)0x00000008U)               /*!< bit offset of LTVAL in FLTYTMLT */
#define FLTYEMMAX_MAXVAL_OFFSET             ((uint32_t)0x00000008U)               /*!< bit offset of MAXVAL in FLTYEMMAX */
#define FLTYEMMIN_MINVAL_OFFSET             ((uint32_t)0x00000008U)               /*!< bit offset of MINVAL in FLTYEMMIN */
#define FLTYCT_CNVCNT_OFFSET                ((uint32_t)0x00000004U)               /*!< bit offset of CNVCNT in FLTYCT */
#define FLTYCTL1_BREAKNUM_OFFSET            ((uint32_t)0x00000018U)               /*!< bit offset of BREAKNUM in FLTYCTL1 */
#define FLTSUMTMHT_SHTVAL_OFFSET            ((uint32_t)0x00000008U)               /*!< bit offset of HTVAL in FLTYTMHT */
#define FLTSUMTMLT_SLTVAL_OFFSET            ((uint32_t)0x00000008U)               /*!< bit offset of LTVAL in FLTYTMLT */
#define SIGN_BIT_OFFSET                     ((uint32_t)0x00800000U)               /*!< bit offset of signed value */
#define CDASEL_MASK                         ((uint32_t)0x00000003U)               /*!< sum threshold monitor conversion data A */
#define CDBSEL_MASK                         ((uint32_t)0x0000000CU)               /*!< sum threshold monitor conversion data B */
#define TMFDASEL_MASK                       ((uint32_t)0x00000070U)               /*!< sum threshold monitor tm_filter data A value */
#define TMFDBSEL_MASK                       ((uint32_t)0x00000380U)               /*!< sum threshold monitor tm_filter data B value */
#define SHTBSD_MASK                         ((uint32_t)0x0000000FU)               /*!< sum threshold monitor high threshold event break signal value */
#define SLTBSD_MASK                         ((uint32_t)0x0000000FU)               /*!< sum threshold monitor low threshold event break signal value */
#define SIGNVAL_MASK                        ((uint32_t)0xFF000000U)               /*!< sign value mask */  

/*!
    \brief      reset HPDF (API_ID(0x0001))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hpdf_deinit(void)
{
    /* reset HPDF */
    rcu_periph_reset_enable(RCU_HPDFRST);
    rcu_periph_reset_disable(RCU_HPDFRST);
}

/*!
    \brief      initialize the parameters of HPDF channel struct with the default values (API_ID(0x0002))
    \param[in]  init_struct: the initialization data needed to initialize HPDF
                  serial_interface: SPI_RISING_EDGE, SPI_FALLING_EDGE, MANCHESTER_CODE0, MANCHESTER_CODE1
                  spi_ck_source: EXTERNAL_CKIN, INTERNAL_CKOUT, HALF_CKOUT_FALLING_EDGE, HALF_CKOUT_RISING_EDGE
                  malfunction_monitor: MM_DISABLE, MM_ENABLE
                  calibration_offset: calibration offset(-8388608 ~ 8388607)
                  right_bit_shift: data right bit-shift(0 ~ 31)
                  channel_multiplexer: SERIAL_INPUT, ADC_INPUT, INTERNAL_INPUT
                  channel_pin_select: CHPINSEL_CURRENT, CHPINSEL_NEXT
                  ck_loss_detector: CLK_LOSS_DISABLE, CLK_LOSS_ENABLE
                  data_packing_mode: DPM_STANDARD_MODE, DPM_INTERLEAVED_MODE, DPM_DUAL_MODE
                  tm_filter: TM_FASTSINC, TM_SINC1, TM_SINC2, TM_SINC3
                  tm_filter_oversample: threshold monitor filter oversampling rate(1 ~ 32), TM_FLT_BYPASS=0
                  mm_break_signal: DISABLE, ENABLE
                  mm_counter_threshold: malfunction monitor counter threshold(0 ~ 255)
                  plsk_value: the number of serial input samples that will be skipped(0 ~ 63)
    \param[out] none
    \retval     none
*/
void hpdf_channel_struct_para_init(hpdf_channel_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the struct with the default values */
        init_struct->serial_interface       = SPI_RISING_EDGE;
        init_struct->spi_ck_source          = EXTERNAL_CKIN;
        init_struct->malfunction_monitor    = MM_DISABLE;
        init_struct->calibration_offset     = 0;
        init_struct->right_bit_shift        = 0U;
        init_struct->channel_multiplexer    = SERIAL_INPUT;
        init_struct->channel_pin_select     = CHPINSEL_CURRENT;
        init_struct->ck_loss_detector       = CLK_LOSS_DISABLE;
        init_struct->data_packing_mode      = DPM_STANDARD_MODE;
        init_struct->tm_filter              = TM_FASTSINC;
        init_struct->tm_filter_oversample   = TM_FLT_BYPASS;
        init_struct->mm_break_signal        = DISABLE;
        init_struct->mm_counter_threshold   = 0U;
        init_struct->plsk_value             = 0U;
    }
}

/*!
    \brief      initialize the parameters of HPDF filter struct with the default values (API_ID(0x0003))
    \param[in]  init_struct: the initialization data needed to initialize HPDF
                  sinc_filter: FLT_FASTSINC, FLT_SINC1, FLT_SINC2, FLT_SINC3, FLT_SINC4, FLT_SINC5
                  sinc_oversample: sinc filter oversampling rate(1 ~ 1024), FLT_SINC_BYPASS=0
                  integrator_oversample: integrator oversampling rate(1 ~ 256), INTEGRATOR_BYPASS=0
                  tm_fast_mode: TMFM_DISABLE, TMFM_ENABLE
                  tm_channel: TMCHEN_DISABLE, TMCHEN_CHANNEL0, TMCHEN_CHANNEL1, TMCHEN_CHANNEL0_1
                  tm_high_threshold: threshold monitor high threshold(-8388608 ~ 8388607)
                  tm_low_threshold: threshold monitor low threshold value(-8388608 ~ 8388607)
                  extreme_monitor_channel: EM_CHANNEL_DISABLE, EM_CHANNEL0, EM_CHANNEL1, EM_CHANNEL0_1
                  ht_break_signal: NO_TM_HT_BREAK, TM_HT_BREAK0, TM_HT_BREAK1, TM_HT_BREAK0_1
                  lt_break_signal: NO_TM_LT_BREAK, TM_LT_BREAK0, TM_LT_BREAK1, TM_LT_BREAK0_1
    \param[out] none
    \retval     none
*/
void hpdf_filter_struct_para_init(hpdf_filter_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the struct with the default values */
        init_struct->sinc_filter                = FLT_FASTSINC;
        init_struct->sinc_oversample            = FLT_SINC_BYPASS;
        init_struct->integrator_oversample      = INTEGRATOR_BYPASS;
        init_struct->tm_fast_mode               = TMFM_DISABLE;
        init_struct->tm_channel                 = TMCHEN_DISABLE;
        init_struct->tm_high_threshold          = 0;
        init_struct->tm_low_threshold           = 0;
        init_struct->extreme_monitor_channel    = EM_CHANNEL_DISABLE;
        init_struct->ht_break_signal            = NO_TM_HT_BREAK;
        init_struct->lt_break_signal            = NO_TM_LT_BREAK;
        init_struct->break_number               = 1U;
    }
}

/*!
    \brief      initialize the parameters of regular conversion struct with the default values (API_ID(0x0004))
    \param[in]  init_struct: the initialization data needed to initialize HPDF
                  continuous_mode: RCCM_DISABLE, RCCM_ENABLE
                  fast_mode: FAST_DISABLE, FAST_ENABLE
                  rcdmaen: RCDMAEN_DISABLE, RCDMAEN_ENABLE
                  rcsyn: RCSYN_DISABLE, RCSYN_ENABLE
                  rcs_channel: RCS_CHANNELx(x=0..7)
    \param[out] none
    \retval     none
*/
void hpdf_rc_struct_para_init(hpdf_rc_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the struct with the default values */
        init_struct->continuous_mode        = RCCM_DISABLE;
        init_struct->fast_mode              = FAST_DISABLE;
        init_struct->rcdmaen                = RCDMAEN_DISABLE;
        init_struct->rcsyn                  = RCSYN_DISABLE;
        init_struct->rcs_channel            = RCS_CHANNEL0;
    }
}

/*!
    \brief      initialize the parameters of inserted conversion struct with the default values (API_ID(0x0005))
    \param[in]  init_struct: the initialization data needed to initialize HPDF
                  scmod: SCMOD_DISABLE, SCMOD_ENABLE
                  icdmaen: ICDMAEN_DISABLE, ICDMAEN_ENABLE
                  ic_channel_group: ICGSEL_CHANNELx(x=0..7)
                  icsyn: ICSYN_DISABLE, ICSYN_ENABLE
                  trigger_edge: TRG_DISABLE, RISING_EDGE_TRG, FALLING_EDGE_TRG, EDGE_TRG
                  trigger_signal: HPDF_ITRGx(x=0..8), HPDF_ITRG11, HPDF_ITRG12, HPDF_ITRG24, HPDF_ITRG25, HPDF_ITRG31
    \param[out] none
    \retval     none
*/
void hpdf_ic_struct_para_init(hpdf_ic_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the struct with the default values */
        init_struct->scmod              = SCMOD_DISABLE;
        init_struct->icdmaen            = ICDMAEN_DISABLE;
        init_struct->ic_channel_group   = ICGSEL_CHANNEL0;
        init_struct->icsyn              = ICSYN_DISABLE;
        init_struct->trigger_edge       = TRG_DISABLE;
        init_struct->trigger_signal     = HPDF_ITRG0;
    }
}

/*!
    \brief      enable the HPDF module globally (API_ID(0x0006))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hpdf_enable(void)
{
    /* enable the HPDF module globally */
    HPDF_CHXCTL(CHANNEL0) |= HPDF_CH0CTL_HPDFEN;
}

/*!
    \brief      disable the HPDF module globally (API_ID(0x0007))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hpdf_disable(void)
{
    /* disable the HPDF module globally */
    HPDF_CHXCTL(CHANNEL0) &= ~HPDF_CH0CTL_HPDFEN;
}

/*!
    \brief      initialize the HPDF channel (API_ID(0x0008))
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  init_struct: the initialization data needed to initialize HPDF channel
                  serial_interface: SPI_RISING_EDGE, SPI_FALLING_EDGE, MANCHESTER_CODE0, MANCHESTER_CODE1
                  spi_ck_source: EXTERNAL_CKIN, INTERNAL_CKOUT, HALF_CKOUT_FALLING_EDGE, HALF_CKOUT_RISING_EDGE
                  malfunction_monitor: MM_DISABLE, MM_ENABLE
                  calibration_offset: calibration offset(-8388608 ~ 8388607)
                  right_bit_shift: data right bit-shift(0 ~ 31)
                  channel_multiplexer: SERIAL_INPUT, ADC_INPUT, INTERNAL_INPUT
                  channel_pin_select: CHPINSEL_CURRENT, CHPINSEL_NEXT
                  ck_loss_detector: CLK_LOSS_DISABLE, CLK_LOSS_ENABLE
                  data_packing_mode: DPM_STANDARD_MODE, DPM_INTERLEAVED_MODE, DPM_DUAL_MODE
                  tm_filter: TM_FASTSINC, TM_SINC1, TM_SINC2, TM_SINC3
                  tm_filter_oversample: threshold monitor filter oversampling rate(1 ~ 32), TM_FLT_BYPASS=0
                  mm_break_signal: DISABLE, ENABLE
                  mm_counter_threshold: malfunction monitor counter threshold(0 ~ 255)
                  plsk_value: the number of serial input samples that will be skipped(0 ~ 63)
    \param[out] none
    \retval     none
*/
void hpdf_channel_init(hpdf_channel_enum channelx, hpdf_channel_parameter_struct *init_struct)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the HPDF_CHXCTL */
        reg = HPDF_CHXCTL(channelx);
        reg &= ~(HPDF_CHXCTL_SPICKSS | HPDF_CHXCTL_SITYP | HPDF_CHXCTL_MMEN | HPDF_CHXCTL_CKLEN | HPDF_CHXCTL_CHPINSEL | \
                 HPDF_CHXCTL_CMSD | HPDF_CHXCTL_DPM);
        reg |= (init_struct->spi_ck_source | init_struct->serial_interface | init_struct->malfunction_monitor | \
                init_struct->channel_multiplexer | init_struct->channel_pin_select | init_struct->ck_loss_detector | \
                init_struct->data_packing_mode);
        HPDF_CHXCTL(channelx) = reg;
        /* configure the HPDF_CHXCFG0 */
        reg = HPDF_CHXCFG0(channelx);
        reg &= ~(HPDF_CHXCFG0_CALOFF | HPDF_CHXCFG0_DTRS);
        reg |= (((uint32_t)init_struct-> calibration_offset << CHXCFG0_CALOFF_OFFSET) | (init_struct->right_bit_shift << CHXCFG_DTRS_OFFSET));
        HPDF_CHXCFG0(channelx) = reg;
        /* configure the HPDF_CHXCFG1 */
        reg = HPDF_CHXCFG1(channelx);
        reg &= ~(HPDF_CHXCFG1_TMSFO | HPDF_CHXCFG1_TMFOR | HPDF_CHXCFG1_MMBSD | HPDF_CHXCFG1_MMCT);
        reg |= (init_struct->tm_filter | ((init_struct->tm_filter_oversample - 1U) << CHXCFG1_TMFOR_OFFSET) | init_struct->mm_break_signal | \
                init_struct->mm_counter_threshold);
        HPDF_CHXCFG1(channelx) = reg;
        /* configure the HPDF_CHXPS */
        reg = HPDF_CHXPS(channelx);
        reg &= ~(HPDF_CHXPS_PLSK);
        reg |= init_struct->plsk_value;
        HPDF_CHXPS(channelx) = reg;
    }
}

/*!
    \brief      initialize the HPDF filter (API_ID(0x0009))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  init_struct: the initialization data needed to initialize HPDF filter
                  sinc_filter: FLT_FASTSINC, FLT_SINC1, FLT_SINC2, FLT_SINC3, FLT_SINC4, FLT_SINC5
                  sinc_oversample: sinc filter oversampling rate(1 ~ 1024), FLT_SINC_BYPASS=0
                  integrator_oversample: integrator oversampling rate(1 ~ 256), INTEGRATOR_BYPASS=0
                  tm_fast_mode: TMFM_DISABLE, TMFM_ENABLE
                  tm_channel: TMCHEN_DISABLE, TMCHEN_CHANNELx(x=0..7)
                  tm_high_threshold: threshold monitor high threshold(-8388608 ~ 8388607)
                  tm_low_threshold: threshold monitor low threshold value(-8388608 ~ 8388607)
                  extreme_monitor_channel: EM_CHANNEL_DISABLE, EM_CHANNELx(x=0..7)
                  ht_break_signal: NO_TM_HT_BREAK, TM_HT_BREAKx(x=0..3)
                  lt_break_signal: NO_TM_LT_BREAK, TM_LT_BREAKx(x=0..3)
                  break_number(only for GD32H77X): the number of threshold/malfunction events(1 ~ 15)
    \param[out] none
    \retval     none
*/
void hpdf_filter_init(hpdf_filter_enum filtery, hpdf_filter_parameter_struct *init_struct)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the HPDF_FLTYCTL0 */
        HPDF_FLTYCTL0(filtery) |= init_struct->tm_fast_mode;
        /* configure the HPDF_FLTYCTL1 */
        reg = HPDF_FLTYCTL1(filtery);
        reg &= ~(HPDF_FLTYCTL1_TMCHEN | HPDF_FLTYCTL1_EMCS | HPDF_FLTYCTL1_BREAKNUM);
        reg |= (init_struct->tm_channel | init_struct->extreme_monitor_channel | (init_struct->break_number << FLTYCTL1_BREAKNUM_OFFSET));
        HPDF_FLTYCTL1(filtery) = reg;

        /* configure the HPDF_FLTYSFCTL*/
        reg = HPDF_FLTYSFCFG(filtery);
        reg &= ~(HPDF_FLTYSFCFG_SFO | HPDF_FLTYSFCFG_SFOR | HPDF_FLTYSFCFG_IOR);
        reg |= (init_struct->sinc_filter | ((init_struct->sinc_oversample - 1U) << FLTYSFCFG_SFOR_OFFSET) | (init_struct->integrator_oversample - 1U));
        HPDF_FLTYSFCFG(filtery) = reg;
        /* configure the HPDF_FLTYTMHT */
        reg = HPDF_FLTYTMHT(filtery);
        reg &= ~(HPDF_FLTYTMHT_HTVAL | HPDF_FLTYTMHT_HTBSD);
        reg |= (((uint32_t)init_struct->tm_high_threshold << FLTYTMHT_HTVAL_OFFSET) | init_struct->ht_break_signal);
        HPDF_FLTYTMHT(filtery) = reg;
        /* configure the HPDF_FLTYTMLT */
        reg = HPDF_FLTYTMLT(filtery);
        reg &= ~(HPDF_FLTYTMLT_LTVAL | HPDF_FLTYTMLT_LTBSD);
        reg |= (((uint32_t)init_struct->tm_low_threshold << FLTYTMLT_LTVAL_OFFSET) | init_struct->lt_break_signal);
        HPDF_FLTYTMLT(filtery) = reg;
    }
}

/*!
    \brief      initialize the regular conversion (API_ID(0x000A))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  init_struct: the initialization data needed to initialize regular conversion
                  continuous_mode: RCCM_DISABLE, RCCM_ENABLE
                  fast_mode: FAST_DISABLE, FAST_ENABLE
                  rcdmaen: RCDMAEN_DISABLE, RCDMAEN_ENABLE
                  rcsyn: RCSYN_DISABLE, RCSYN_ENABLE
                  rcs_channel: RCS_CHANNELx(x=0..7)
    \param[out] none
    \retval     none
*/
void hpdf_rc_init(hpdf_filter_enum filtery, hpdf_rc_parameter_struct *init_struct)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the HPDF_FLTYCTL0 */
        reg = HPDF_FLTYCTL0(filtery);
        reg &= ~(HPDF_FLTYCTL0_FAST | HPDF_FLTYCTL0_RCS | HPDF_FLTYCTL0_RCDMAEN | HPDF_FLTYCTL0_RCSYN | HPDF_FLTYCTL0_RCCM);
        reg |= (init_struct->continuous_mode | init_struct->fast_mode | init_struct->rcdmaen | init_struct->rcsyn | \
                init_struct->rcs_channel);
        HPDF_FLTYCTL0(filtery) = reg;
    }
}

/*!
    \brief      initialize the inserted conversion (API_ID(0x000B))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  init_struct: the initialization data needed to initialize inserted conversion
                  scmod: SCMOD_DISABLE, SCMOD_ENABLE
                  icdmaen: ICDMAEN_DISABLE, ICDMAEN_ENABLE
                  ic_channel_group: ICGSEL_CHANNELx(x=0..7)
                  icsyn: ICSYN_DISABLE, ICSYN_ENABLE
                  trigger_edge: TRG_DISABLE, RISING_EDGE_TRG, FALLING_EDGE_TRG, EDGE_TRG
                  trigger_signal: HPDF_ITRGx(x=0..8), HPDF_ITRG11, HPDF_ITRG12, HPDF_ITRG24, HPDF_ITRG25, HPDF_ITRG31
    \param[out] none
    \retval     none
*/
void hpdf_ic_init(hpdf_filter_enum filtery, hpdf_ic_parameter_struct *init_struct)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(0x000BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the HPDF_FLTYCTL0 */
        reg = HPDF_FLTYCTL0(filtery);
        reg &= ~(HPDF_FLTYCTL0_ICTEEN | HPDF_FLTYCTL0_ICTSSEL | HPDF_FLTYCTL0_ICDMAEN | HPDF_FLTYCTL0_SCMOD | \
                 HPDF_FLTYCTL0_ICSYN);
        reg |= (init_struct->trigger_edge | init_struct->trigger_signal | init_struct->icdmaen | init_struct->scmod | \
                init_struct->icsyn);
        HPDF_FLTYCTL0(filtery) = reg;
        /* configure the HPDF_FLTYICGS */
        reg = HPDF_FLTYICGS(filtery);
        reg &= ~HPDF_FLTYICGS_ICGSEL;
        reg |= init_struct->ic_channel_group;
        HPDF_FLTYICGS(filtery) = reg;
    }
}

/*!
    \brief      configure serial output clock (API_ID(0x000C))
    \param[in]  source: the HPDF serial clock output source
                only one parameter can be selected which is shown as below:
      \arg        SERIAL_SYSTEM_CLK: serial clock output source is from system clock
      \arg        SERIAL_AUDIO_CLK: serial clock output source is from audio clock
    \param[in]  divider: serial clock output divider 0-255
    \param[in]  mode: serial clock output duty mode
                only one parameter can be selected which is shown as below:
      \arg        CKOUTDM_DISABLE: disable serial clock output duty mode
      \arg        CKOUTDM_ENABLE: enable serial clock output duty mode
    \param[out] none
    \retval     none
*/
void hpdf_clock_output_config(uint32_t source, uint8_t divider, uint32_t mode)
{
    uint32_t reg;

    reg = HPDF_CHXCTL(CHANNEL0);
    reg &= ~(HPDF_CH0CTL_CKOUTSEL | HPDF_CH0CTL_CKOUTDIV | HPDF_CH0CTL_CKOUTDM);
    /* configure serial output clock */
    reg |= (source | ((uint32_t)divider << CH0CTL_CKOUTDIV_OFFSET) | mode);
    HPDF_CHXCTL(CHANNEL0) = reg;
}

/*!
    \brief      configure serial clock output source (API_ID(0x000D))
    \param[in]  source: the HPDF serial clock output source
      \arg        SERIAL_SYSTEM_CLK: serial clock output source is from system clock
      \arg        SERIAL_AUDIO_CLK: serial clock output source is from audio clock
    \param[out] none
    \retval     none
*/
void hpdf_clock_output_source_config(uint32_t source)
{
    uint32_t reg;

    reg = HPDF_CHXCTL(CHANNEL0);
    reg &= ~HPDF_CH0CTL_CKOUTSEL;
    reg |= source;
    HPDF_CHXCTL(CHANNEL0) = reg;
}

